# Написать программу используя цикл for и while. 

for i in range(5):
	print(i); 


j = 0 
while(j<5):
	print(j);
	j=j+1; 
