# 4) решите следующие задачи: 

# 1. Даны два целых числа A и B (при этом A ≤ B). Выведите все числа от A до B включительно. 
A1 = 10 
B1 = 20 

# for x in range(A1,B1):
# 	print(x)

# # 2. Даны два целых числа A и В. Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае. 

# for x in range(A1,B1):
# 	print(x)

# for x in range(B1,A1,-1):
# 	print(x)

# 3. Даны два целых числа A и В,A>B. Выведите все нечётные числа от A до B включительно, в порядке убывания. В этой задаче можно обойтись без инструкции if. 

# for x in range(B1,A1,-2):
# 	print(x)

# 4. Для настольной игры используются карточки с номерами от 1 до N. Одна карточка потерялась. Найдите ее, зная номера оставшихся карточек. 

lst = [1,2,3,5,6]
backup = [1,2,3,4,5,6]


print(temp3)


# Дано число N, далее N − 1 номер оставшихся карточек (различные числа от 1 до N). Программа должна вывести номер потерянной карточки. 


# Для самых умных: массивами и аналогичными структурами данных пользоваться нельзя. 

